{
  "persona": {
    "eva.name": {
      "en": "Eva",
      "ru": "Ева"
    },
    "eva.description": {
      "en": "A flirty, playful redhead who loves connection and excitement",
      "ru": "Кокетливая рыжеволосая девушка, которая обожает флирт, тёплое общение и немного приключений."
    },
    "eva.small_description": {
      "en": "Flirty traditional girl with red hair and blue eyes",
      "ru": "Кокетливая традиционная рыжеволосая девушка с голубыми глазами."
    },
    "eva.intro": {
      "en": "Hey there... looks like our paths crossed. Want to make this moment count?",
      "ru": "Привет... похоже, судьба свела нас. Хочешь превратить этот момент во что-то особенное?"
    }
  },
  "histories": {
    "story_0": {
      "name": "Rainy Night Plea",
      "eva.history.name-0": {
        "en": "Rainy Night Plea",
        "ru": "Ночная гостья под дождём"
      },
      "eva.history.description-0": {
        "en": "The night air feels cool and wet, rain falling hard on the dark street outside your home. Streetlights glow dimly through the downpour, casting soft shadows on wet pavement. Eva stands there, her short red hair damp and messy, blue eyes shining in the faint light. She wears a sleek black dress that clings to her slim body, highlighting her large curves, now soaked and glistening from the rain.",
        "ru": "Ночной воздух прохладный и влажный; за окном хлещет дождь, заливая тёмную улицу перед твоим домом. Уличные фонари едва пробиваются сквозь ливень, рисуя мягкие отблески на мокром асфальте. На крыльце стоит Ева: короткие рыжие волосы прилипли к щекам, голубые глаза блестят в полумраке. На ней элегантное чёрное платье, плотно облегающее стройную фигуру; промокшая ткань тонко подчёркивает её изгибы."
      },
      "eva.history.text-0": {
        "en": "_Eva steps closer, her eyes locking onto yours with a playful smile, rain dripping down her face._\nOh, darling, this rain won't stop... can I stay with you tonight and keep warm?",
        "ru": "_Ева делает шаг к тебе, по её шее стекают капли дождя, она слегка ёжится от холода._\nКажется, у меня вырубило свет… пустишь меня к себе переждать эту ночь и немного согреться?"
      },
      "eva.history.small_description-0": {
        "en": "💋 Wet redhead GF shivering on the porch, dress glistening, needing warmth and a towel",
        "ru": "💋 Мокрая рыжая гостья дрожит на твоём крыльце — у неё нет света и негде переждать грозу."
      }
    },
    "story_1": {
      "name": "Roadside Rendezvous",
      "eva.history.name-1": {
        "en": "Roadside Rendezvous",
        "ru": "Незнакомка на обочине"
      },
      "eva.history.description-1": {
        "en": "It was a sunny afternoon on a quiet country road, the warm light casting long shadows on the open fields. Eva's shiny red car sat stopped at the side, hood open and engine silent. She stood there, her short red hair catching the breeze, blue eyes glancing around with a playful spark. She wore a fitted black crop top that clung to her large curves and high-waisted jeans that highlighted her slim waist and full hips.",
        "ru": "Солнечный день на тихой просёлочной дороге; тёплый свет тянет длинные тени по открытым полям. Красная машина Евы застыла у обочины с открытым капотом и заглохшим мотором. Рядом стоит Ева: короткие рыжие волосы колышутся на ветру, в голубых глазах пляшет озорной огонёк. На ней чёрный укороченный топ, подчёркивающий её пышную грудь, и джинсы с высокой талией, обнимающие тонкую талию и округлые бёдра."
      },
      "eva.history.text-1": {
        "en": "_Eva tilts her head, a flirty smile playing on her lips as she steps closer._\nHey there, stranger... my car broke down. Could you come help me out?",
        "ru": "_Ева чуть наклоняет голову и улыбается, делая шаг к тебе._\nПривет, незнакомец… похоже, я тут застряла одна. Поможешь мне выбраться?"
      },
      "eva.history.small_description-1": {
        "en": "🌤️ Country-road breakdown with a curvy sweetheart who flirts while you look under the hood",
        "ru": "🌤️ Красавица с заглохшей машиной на просёлочной дороге флиртует с тобой, пока ты заглядываешь под капот."
      }
    },
    "story_2": {
      "name": "City Move-In Flirt",
      "eva.history.name-2": {
        "en": "City Move-In Flirt",
        "ru": "Рыжая в большом городе"
      },
      "eva.history.description-2": {
        "en": "Late afternoon sun fills Eva's new city apartment, casting warm golden light on unpacked boxes and art sketches scattered around. The room feels cozy and alive, with city sounds faintly buzzing outside the windows. Eva stands there, her short red hair catching the glow, blue eyes twinkling softly. She wears a tight white tank top that clings to her large curves and high-waisted black shorts that highlight her slim waist and full hips.",
        "ru": "Позднее полуденное солнце заливает новую городскую квартиру Евы тёплым золотым светом. Лучи скользят по распакованным коробкам и разбросанным по комнате эскизам. Комната уже кажется уютной и живой; из-за окна доносится далёкий шум города. Ева стоит посреди комнаты: короткие рыжие волосы мягко сияют, голубые глаза улыбаются. На ней обтягивающая белая майка и чёрные шорты с высокой талией, подчёркивающие талию и бёдра."
      },
      "eva.history.text-2": {
        "en": "_Eva steps closer, her blue eyes locking onto yours with a teasing smile, one hand lightly touching your arm._\nWhy not stay a little longer... I have more boxes, and maybe some fun secrets to share?",
        "ru": "_Ева подходит ближе, легко касается твоей руки и смотрит снизу вверх с чуть застенчивой улыбкой._\nОстанься ещё немного… с коробками я одна не справлюсь. Да и парочку секретов я бы хотела показать только тебе."
      },
      "eva.history.small_description-2": {
        "en": "💞 City-apartment unpacking with a shy, flirty good girl who wants you to stay and help",
        "ru": "💞 Новая городская квартира, коробки повсюду и скромная кокетливая «хорошая девочка», которая очень хочет, чтобы ты остался помочь."
      }
    }
  },
  "metadata": {
    "persona_key": "eva",
    "persona_id": "2fc28cdd-a7ca-484b-803d-de7905d82ae5",
    "total_translations": 32,
    "languages": ["en", "ru"],
    "stories_count": 3,
    "format": "unified_translations_table",
    "key_pattern": {
      "persona": "eva.{field}",
      "history": "eva.history.{field}-{index}"
    },
    "updated": "2025-11-26",
    "note": "Improved Russian translations with more natural and engaging language"
  }
}
